Tugas 2/ci4 news/app/Models/BooksModel.php

SELECT *
FROM `books`
SELECT *
FROM `books`
WHERE `slug` = 'indonesia'
 LIMIT 1
---
    public function getBuku($slug = false)
    {
        if ($slug == false){
            return $this->findAll();
        }

    return $this->where(['slug' => $slug])->first();